<?php

$lang['required']			= "The %s поле необходимо.";
$lang['isset']				= "The %s поле должен иметь значение.";
$lang['valid_email']		= "The %s поле должен содержать действительный адрес электронной почты.";
$lang['valid_emails']		= "The %s поле должен содержать все действительные адреса электронной почты.";
$lang['valid_url']			= "The %s поле должен быть действительным URL.";
$lang['valid_ip']			= "The %s поле должен быть действительным IP.";
$lang['min_length']			= "The %s поле должна быть не менее% s символов в длину.";
$lang['max_length']			= "The %s поле не может превышать % S символов в длину.";
$lang['exact_length']		= "The %s поле должно быть ровно % S символов в длину.";
$lang['alpha']				= "The %s поле может содержать только буквенные символы.";
$lang['alpha_numeric']		= "The %s поле может содержать только буквенно-цифровые символы.";
$lang['alpha_dash']			= "The %s поле может содержать только буквенно-цифровые символы , подчеркивания и тире.";
$lang['numeric']			= "The %s поле должен содержать только цифры.";
$lang['is_numeric']			= "The %s поле должен содержать только цифровые символы.";
$lang['integer']			= "The %s поле должен содержать целое число.";
$lang['regex_match']		= "The %s поле не в правильном формате.";
$lang['matches']			= "The %s поле не соответствует поле S%.";
$lang['is_unique'] 			= "The %s поле должен содержать уникальное значение.";
$lang['is_natural']			= "The %s поле должен содержать только положительные числа.";
$lang['is_natural_no_zero']	= "The %s поле должно содержать число больше нуля.";
$lang['decimal']			= "The %s поле должно содержать десятичное число.";
$lang['less_than']			= "The %s поле должен содержать число меньше % S.";
$lang['greater_than']		= "The %s поле должно содержать число больше % S.";
$lang['alpha_dash_space']		= "The %s поле должно содержать только буквы , цифры и пробелы";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */